Revit 2024 API
BuiltInFailures.PipingFailures Class
 Failures about Pipes.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class PipingFailures
Visual Basic
Public NotInheritable Class PipingFailures
Visual C++
public ref class PipingFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.PipingFailures
See Also
BuiltInFailures.PipingFailures Members
Autodesk.Revit.DB Namespace